Autodesk.Revit.DB.PlanViewRangeLevel
An enumerated type representing the options for seting the range for a plan view.
Since:
2013

Autodesk.Revit.DB.PlanViewRangeLevel.Below
View range is the level below

Autodesk.Revit.DB.PlanViewRangeLevel.Current
View range is the current level

Autodesk.Revit.DB.PlanViewRangeLevel.Above
View range is the level above

Autodesk.Revit.DB.PlanViewRangeLevel.Unlimited
View range is unlimited